Repository: MJes-MobiGrill/mr-ribs-order-app
Catalog: lib/l10n/app_*.arb
Languages: de

# appName
source: Mr. Ribs Order App
de: Mr. Ribs Bestell-App

# appSubtitle
source: Order App
de: Bestell-App

source: Select Language
de: Sprache auswählen

# selectLanguageHint
source: Select Language / Sprache ausw√§hlen
de: Select Language / Sprache auswählen

source: Select Order Type
de: Bestellart auswählen

# selectConsumptionType
source: How would you like to enjoy your meal?
de: Wie möchten Sie Ihr Essen genießen?

source: Order On-Site
de: Vor Ort bestellen

# orderOnSiteDescription
source: Order with restaurant device
de: Mit dem Restaurant-Gerät bestellen

source: Dine In
de: Vor Ort essen

# dineInDescription
source: Eat here at the restaurant
de: Hier im Restaurant essen

source: Takeaway
de: Zum Mitnehmen

# takeawayDescription
source: Take your order to go
de: Bestellung zum Mitnehmen

# consumptionTypeInfo
source: You can change this option later if needed.
de: Sie können diese Option später bei Bedarf ändern.

source: Proceeding to menu...
de: Weiter zum Menü...

source: Scan QR Code
de: QR-Code scannen

# scanQrCodeDescription
source: Scan QR code to identify restaurant
de: QR-Code scannen um Restaurant zu identifizieren

source: Processing QR-Code...
de: Verarbeite QR-Code...

source: QR-Code Valid
de: QR-Code Gültig

source: QR-Code Invalid
de: QR-Code Ungültig

# qrCodeErrorMessage
source: This QR-Code is not valid or the restaurant is not active.
de: Dieser QR-Code ist nicht gültig oder das Restaurant ist nicht aktiv.

source: Reserve Table
de: Tisch reservieren

# reserveTableDescription
source: Book a table in advance
de: Tisch im Voraus buchen

source: Order Online
de: Online bestellen

# orderOnlineDescription
source: Order with your own device
de: Mit deinem eigenen Gerät bestellen

source: Device Check
de: Geräte-Prüfung

# deviceCheckMessage
source: Checking device registration...
de: Prüfe Geräte-Registrierung...

source: Device Registered
de: Gerät Registriert

source: Device Not Registered
de: Gerät Nicht Registriert

# deviceNotRegisteredMessage
source: This device is not registered with any Mr. Ribs restaurant.
de: Dieses Gerät ist in keinem Mr. Ribs Restaurant registriert.

source: Address
de: Adresse

source: Device ID
de: Geräte-ID

source: Proceed to Menu
de: Zum Menü

source: Alternative options:
de: Alternative Optionen:

source: Error
de: Fehler

# errorMessage
source: An error occurred
de: Ein Fehler ist aufgetreten

# scanQrCodeMessage
source: Point your camera at the QR code or test with the buttons below:
de: Richte deine Kamera auf den QR-Code oder teste mit den Buttons unten:

# reserveTableMessage
source: Select date, time and number of guests for your reservation.
de: Wähle Datum, Uhrzeit und Anzahl der Gäste für deine Reservierung.

source: Coming Soon
de: Bald verfügbar

# comingSoonMessage
source: This feature will be implemented soon.
de: Diese Funktion wird bald implementiert.

source: Cancel
de: Abbrechen

source: Proceed
de: Fortfahren

source: Start Scan
de: Scan starten

source: Try Again
de: Erneut versuchen

# webCameraNotSupported
source: Camera not supported in web browser
de: Kamera wird im Webbrowser nicht unterstützt

# useTestButtonsBelow
source: Use the test buttons below to simulate QR code scanning:
de: Verwende die Test-Buttons unten um QR-Code-Scanning zu simulieren:

# pointCameraAtQrCode
source: Point your camera at a QR code
de: Richte deine Kamera auf einen QR-Code

# tryAnotherQrCode
source: Please try scanning another QR code.
de: Bitte versuche einen anderen QR-Code zu scannen.

# webQrScannerInfo
source: QR-Code scanning is not available in web browsers. Please use the mobile app or scan QR codes with your device's camera app.
de: QR-Code-Scanning ist in Webbrowsern nicht verfügbar. Bitte nutze die Mobile-App oder scanne QR-Codes mit der Kamera-App deines Geräts.

source: Back to Menu
de: Zurück zum Menü

# qrCodeScanHint
source: Hold steady and wait for auto-detection
de: Ruhig halten und auf automatische Erkennung warten

# cameraPermissionDenied
source: Camera permission is required for QR-Code scanning
de: Kamera-Berechtigung ist für QR-Code-Scanning erforderlich

source: Scan Now
de: Jetzt scannen

# tapScanButton
source: Tap the scan button to detect QR codes
de: Tippe den Scan-Button um QR-Codes zu erkennen

# cameraActiveInBackground
source: Camera is active in background
de: Kamera ist im Hintergrund aktiv

source: Initializing camera...
de: Kamera wird initialisiert...

source: Start Camera
de: Kamera starten

# useWebVersion
source: Use Web Version for Camera
de: Web-Version für Kamera verwenden

# webVersionRecommended
source: For QR-Code scanning, please use the web version at mrribsorderapp.netlify.app
de: Für QR-Code-Scanning nutze bitte die Web-Version unter mrribsorderapp.netlify.app

source: Scan Result
de: Scan-Ergebnis

# emailHint
source: your.email@example.com
de: ihre.email@beispiel.de

source: Phone Number
de: Telefonnummer

# phoneNumberRequired
source: Phone Number *
de: Telefonnummer *

source: Delivery Address
de: Lieferadresse

source: Street
de: Straße

# streetRequired
source: Street *
de: Straße *

# streetHint
source: Example Street
de: Musterstraße

# houseNumber
source: No.
de: Nr.

# houseNumberRequired
source: No. *
de: Nr. *

source: Postal Code
de: PLZ

# postalCodeRequired
source: Postal Code *
de: PLZ *

source: City
de: Stadt

# cityRequired
source: City *
de: Stadt *

# deliveryNotes
source: Delivery Notes (optional)
de: Lieferhinweise (optional)

# additionalNotes
source: Additional Notes (optional)
de: Anmerkungen (optional)

# notesHint
source: e.g. allergies, special requests...
de: z.B. Allergien, besondere Wünsche...

# marketingConsent
source: I would like to receive offers and news
de: Ich möchte über Angebote und Neuigkeiten informiert werden

# privacyNote
source: By entering your data, you agree to our privacy policy.
de: Mit der Eingabe Ihrer Daten stimmen Sie unseren Datenschutzbestimmungen zu.

source: Reservation Details
de: Reservierungsdetails

source: Date
de: Datum

# dateRequired
source: Date *
de: Datum *

source: Select Date
de: Datum wählen

source: Time
de: Uhrzeit

# timeRequired
source: Time *
de: Uhrzeit *

source: Select Time
de: Zeit wählen

# numberOfGuests
source: Guests
de: Personen

# numberOfGuestsRequired
source: Guests *
de: Personen *

source: Guest
de: Person

source: Guests
de: Personen

# specialRequests
source: Special Requests (optional)
de: Besondere Wünsche (optional)

source: Confirmation by email
de: Bestätigung per E-Mail

source: Pickup confirmation by email
de: Abholbestätigung per E-Mail

source: Delivery confirmation by email
de: Lieferbestätigung per E-Mail

source: Reservation confirmation by email
de: Reservierungsbestätigung per E-Mail

source: Delivery
de: Lieferung

# deliveryDescription
source: Home delivery
de: Lieferung nach Hause

# yourContactData
source: Your contact information for the order
de: Ihre Kontaktdaten für die Bestellung

# yourContactAndDeliveryData
source: Your contact and delivery information
de: Ihre Kontakt- und Lieferdaten

# yourReservationData
source: Your contact information for the reservation
de: Ihre Kontaktdaten für die Reservierung

source: Continue to order
de: Weiter zur Bestellung

# checkAddressAndContinue
source: Check address & continue
de: Lieferadresse prüfen & weiter

source: Make reservation
de: Tisch reservieren

# dataSaved
source: Data saved - continue to menu
de: Daten gespeichert - weiter zum Menü

# addressConfirmed
source: Delivery address confirmed - continue to menu
de: Lieferadresse bestätigt - weiter zum Menü

# reservationSuccessful
source: Reservation successful! Confirmation sent by email.
de: Reservierung erfolgreich! Bestätigung wurde per E-Mail versendet.

# pleaseEnterEmail
source: Please enter email address
de: Bitte E-Mail-Adresse eingeben

# pleaseEnterValidEmail
source: Please enter valid email address
de: Bitte gültige E-Mail-Adresse eingeben

# pleaseEnterPhone
source: Please enter phone number
de: Bitte Telefonnummer eingeben

# phoneTooShort
source: Phone number too short
de: Telefonnummer zu kurz

source: Please enter street
de: Bitte Straße eingeben

source: Number
de: Nummer

source: Invalid
de: Ungültig

source: Please enter city
de: Bitte Stadt eingeben

# pleaseSelectDateTime
source: Please select date and time
de: Bitte Datum und Uhrzeit wählen

# deliveryAddressCheck
source: Check delivery address
de: Lieferadresse prüfen

source: Enter delivery address
de: Lieferadresse eingeben

# checkDeliveryAvailability
source: We'll check if we can deliver to your address
de: Wir prüfen, ob wir an Ihre Adresse liefern können

source: Check availability
de: Verfügbarkeit prüfen

source: Delivery available!
de: Lieferung verfügbar!

# weDeliverFrom
source: We deliver from {restaurant}
de: Wir liefern von {restaurant}

# distance
source: Distance: {distance} km
de: Entfernung: {distance} km

# noDeliveryPossible
source: Sorry, no delivery possible
de: Leider keine Lieferung möglich

# nearestRestaurantDistance
source: The nearest restaurant is {distance} km away
de: Das nächste Restaurant ist {distance} km entfernt

# addressOutsideDeliveryArea
source: Your address is outside our delivery area
de: Ihre Adresse liegt außerhalb unseres Liefergebiets

# addressNotFound
source: Address not found. Please check your input.
de: Adresse konnte nicht gefunden werden. Bitte überprüfen Sie Ihre Eingabe.

# errorOccurred
source: An error occurred. Please try again later.
de: Ein Fehler ist aufgetreten. Bitte versuchen Sie es später erneut.

source: Search restaurant...
de: Restaurant suchen...

source: No restaurants available
de: Keine Restaurants verfügbar

source: No restaurants found
de: Keine Restaurants gefunden

# currentlyNoLocations
source: Currently no locations available.
de: Aktuell sind keine Standorte verfügbar.

# tryDifferentSearch
source: Try a different search.
de: Versuchen Sie eine andere Suche.

# restaurantForReservation
source: Select restaurant for reservation
de: Restaurant für Reservierung wählen

# restaurantForDelivery
source: Select restaurant for delivery
de: Restaurant für Lieferung wählen

# restaurantForPickup
source: Select restaurant for pickup
de: Restaurant für Abholung wählen

# restaurantForDineIn
source: Select restaurant for dine-in
de: Restaurant zum Essen wählen

source: Select restaurant
de: Restaurant wählen

# reservationPossible
source: Table reservation possible
de: Tischreservierung möglich

# deliveryAvailableShort
source: Delivery available
de: Lieferung verfügbar

source: Pickup possible
de: Abholung möglich

# dineInPossible
source: Dine in
de: Vor Ort essen

source: Available
de: Verfügbar

source: Closed
de: Geschlossen

source: tables
de: Tische

# serviceNotAvailable
source: This service is not available at {restaurant}
de: Dieser Service ist in {restaurant} nicht verfügbar

# onlineOrderInfo
source: Online order: Select your desired service.
de: Online-Bestellung: Wählen Sie Ihren gewünschten Service.

# deliveryInfo
source: Delivery Information
de: Lieferinformationen

source: Delivery Fee
de: Liefergebühr

source: Minimum Order Value
de: Mindestbestellwert

source: Estimated Delivery Time
de: Geschätzte Lieferzeit

# deliveryFeeInfo
source: The delivery fee will be automatically added to your order.
de: Die Liefergebühr wird automatisch zu Ihrer Bestellung hinzugefügt.

# accept
source: Accept & Continue
de: Akzeptieren & Weiter

source: Free Delivery
de: Kostenlose Lieferung

source: Payment on delivery
de: Zahlung bei Lieferung

source: Payment Methods
de: Zahlungsmethoden

source: Cash or Card
de: Bar oder Karte

source: Change address
de: Adresse ändern

source: Continue to menu
de: Weiter zum Menü
